In [1]:
import pandas as pd
import numpy as np

In [87]:
data = pd.read_csv("../Data/england.csv")
data = data[(data.division != '3S')]
data = data[(data.division != '3N')]
data = data.astype({'division':int})
data = data[data.division == 1]
data.head()

,Date,Season,home,visitor,FT,hgoal,vgoal,division,tier,totgoal,goaldif,result
0,1888-09-08,1888,Bolton Wanderers,Derby County,3-6,3,6,1,1,9,-3,A
1,1888-09-08,1888,Everton,Accrington F.C.,2-1,2,1,1,1,3,1,H
2,1888-09-08,1888,Preston North End,Burnley,5-2,5,2,1,1,7,3,H
3,1888-09-08,1888,Stoke City,West Bromwich Albion,0-2,0,2,1,1,2,-2,A
4,1888-09-08,1888,Wolverhampton Wanderers,Aston Villa,1-1,1,1,1,1,2,0,D

# Obtain First Division from season 1980

In [88]:
data_first_division = data[data.Season >= 1980]
data_first_division.head()

,Date,Season,home,visitor,FT,hgoal,vgoal,division,tier,totgoal,goaldif,result
118802,1980-08-16,1980,Birmingham City,Coventry City,3-1,3,1,1,1,4,2,H
118803,1980-08-16,1980,Brighton & Hove Albion,Wolverhampton Wanderers,2-0,2,0,1,1,2,2,H
118804,1980-08-16,1980,Leeds United,Aston Villa,1-2,1,2,1,1,3,-1,A
118805,1980-08-16,1980,Leicester City,Ipswich Town,0-1,0,1,1,1,1,-1,A
118806,1980-08-16,1980,Liverpool,Crystal Palace,3-0,3,0,1,1,3,3,H

# Remove columns unnecessary

In [89]:
data_first_division = data_first_division.drop(["tier", "FT", "division", "totgoal", "goaldif"], axis = 1)
data_first_division.tail()

,Date,Season,home,visitor,hgoal,vgoal,result
198487,2020-07-26,2019,Leicester City,Manchester United,0,2,A
198488,2020-07-26,2019,Manchester City,Norwich City,5,0,H
198489,2020-07-26,2019,Newcastle United,Liverpool,1,3,A
198490,2020-07-26,2019,Southampton,Sheffield United,3,1,H
198491,2020-07-26,2019,West Ham United,Aston Villa,1,1,D

# Separate Date

In [90]:
date = data_first_division.Date.str.split('-',  n=-1, expand=True)
date.columns = ["year", "month", "day"]
date.head()

        year month day
118802  1980    08  16
118803  1980    08  16
118804  1980    08  16
118805  1980    08  16
118806  1980    08  16

In [91]:
data_first_division = data_first_division.drop("Date", axis = 1)
data_first_division = pd.concat([date, data_first_division], axis=1)
data_first_division.head()

,year,month,day,Season,home,visitor,hgoal,vgoal,result
118802,1980,08,16,1980,Birmingham City,Coventry City,3,1,H
118803,1980,08,16,1980,Brighton & Hove Albion,Wolverhampton Wanderers,2,0,H
118804,1980,08,16,1980,Leeds United,Aston Villa,1,2,A
118805,1980,08,16,1980,Leicester City,Ipswich Town,0,1,A
118806,1980,08,16,1980,Liverpool,Crystal Palace,3,0,H

# Create dictionary teams

In [92]:
teams_set = set(data_first_division.home).union(set(data_first_division.visitor))
team_number = range(len(teams_set))
teams_dict = dict(zip(teams_set, team_number))
teams_dict

{'Ipswich Town': 0,
 'Luton Town': 1,
 'Bradford City': 2,
 'Wolverhampton Wanderers': 3,
 'Crystal Palace': 4,
 'Portsmouth': 5,
 'Hull City': 6,
 'Queens Park Rangers': 7,
 'Blackpool': 8,
 'Cardiff City': 9,
 'Manchester City': 10,
 'Fulham': 11,
 'Stoke City': 12,
 'Southampton': 13,
 'Tottenham Hotspur': 14,
 'Blackburn Rovers': 15,
 'Millwall': 16,
 'Manchester United': 17,
 'Sheffield Wednesday': 18,
 'Middlesbrough': 19,
 'Nottingham Forest': 20,
 'AFC Bournemouth': 21,
 'Leeds United': 22,
 'West Ham United': 23,
 'Brighton & Hove Albion': 24,
 'Huddersfield Town': 25,
 'Notts County': 26,
 'Sheffield United': 27,
 'Watford': 28,
 'Everton': 29,
 'West Bromwich Albion': 30,
 'Oxford United': 31,
 'Reading': 32,
 'Swindon Town': 33,
 'Derby County': 34,
 'Barnsley': 35,
 'Oldham Athletic': 36,
 'Birmingham City': 37,
 'Leicester City': 38,
 'Norwich City': 39,
 'Swansea City': 40,
 'Newcastle United': 41,
 'Coventry City': 42,
 'Liverpool': 43,
 'Arsenal': 44,
 'Charlton Athletic': 45,
 'Wimbledon': 46,
 'Burnley': 47,
 'Aston Villa': 48,
 'Chelsea': 49,
 'Wigan Athletic': 50,
 'Sunderland': 51,
 'Bolton Wanderers': 52}

In [93]:
teams_df = pd.DataFrame({"team_name":list(teams_set), "team_number":team_number})
teams_df.head()

                 team_name  team_number
0             Ipswich Town            0
1               Luton Town            1
2            Bradford City            2
3  Wolverhampton Wanderers            3
4           Crystal Palace            4

In [94]:
teams_df.to_csv("../Data/teams.csv", index=False)

In [95]:
data_first_division.home = data_first_division.home.apply(teams_dict.get)
data_first_division.visitor = data_first_division.visitor.apply(teams_dict.get)
data_first_division.head()

        year month day  Season  home  visitor  hgoal  vgoal result
118802  1980    08  16    1980    37       42      3      1      H
118803  1980    08  16    1980    24        3      2      0      H
118804  1980    08  16    1980    22       48      1      2      A
118805  1980    08  16    1980    38        0      0      1      A
118806  1980    08  16    1980    43        4      3      0      H

# Modify Result

In [96]:
result_dict = {"D":1, "H":2, "A":3}
data_first_division.result = data_first_division.result.apply(result_dict.get)
data_first_division.head()

        year month day  Season  home  visitor  hgoal  vgoal  result
118802  1980    08  16    1980    37       42      3      1       2
118803  1980    08  16    1980    24        3      2      0       2
118804  1980    08  16    1980    22       48      1      2       3
118805  1980    08  16    1980    38        0      0      1       3
118806  1980    08  16    1980    43        4      3      0       2

# Add week

In [97]:
temp = data_first_division[(data_first_division.year == "2018") | (data_first_division.year == "2019")]
temp.groupby(by=["year", "month", "day"]).count()

                Season  home  visitor  hgoal  vgoal  result
year month day
2018 01    01        5     5        5      5      5       5
           02        4     4        4      4      4       4
           03        1     1        1      1      1       1
           04        1     1        1      1      1       1
           13        7     7        7      7      7       7
...                ...   ...      ...    ...    ...     ...
2019 12    22        2     2        2      2      2       2
           26        9     9        9      9      9       9
           27        1     1        1      1      1       1
           28        7     7        7      7      7       7
           29        3     3        3      3      3       3

[212 rows x 6 columns]

In [98]:
con = [(1995, 2020, 38), (1991, 1995, 42), (1988, 1991, 38), (1987, 1988, 40), (1980, 1987, 42)]
s = dict()
for a, b, jornada in con:
    for i in range(a, b):
        s[i] = jornada
# s: season => num jornadas en la season

In [99]:
data_first_division = data_first_division.reset_index()
data_first_division = data_first_division.drop("index", axis = 1)
data_first_division.tail()

       year month day  Season  home  visitor  hgoal  vgoal  result
16137  2020    07  26    2019    38       17      0      2       3
16138  2020    07  26    2019    10       39      5      0       2
16139  2020    07  26    2019    41       43      1      3       3
16140  2020    07  26    2019    13       27      3      1       2
16141  2020    07  26    2019    23       48      1      1       1

In [100]:

temp = data_first_division.copy()
temp["jornada"] = np.zeros(len(temp))
for season in data_first_division.Season.unique():
    data_season = data_first_division[data_first_division.Season == season]
    equipos = data_season.home.unique()
    conteo = dict(zip(equipos, [0] * len(equipos)))   
    for index, row in data_season.iterrows():
        conteo[row.home] += 1
        conteo[row.visitor] += 1
        temp.iloc[index, -1] = conteo[row.home]

temp = temp.astype({"jornada":int})
temp.tail()

       year month day  Season  home  visitor  hgoal  vgoal  result  jornada
16137  2020    07  26    2019    38       17      0      2       3       38
16138  2020    07  26    2019    10       39      5      0       2       38
16139  2020    07  26    2019    41       43      1      3       3       38
16140  2020    07  26    2019    13       27      3      1       2       38
16141  2020    07  26    2019    23       48      1      1       1       38

In [101]:
data_first_division = temp

# Save CSV

In [85]:
data_first_division.to_csv("../Data/england-clean.csv", index = 0)